tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "//share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" dumptraffic="false" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" />
  </clients>
  
  <servers>
     <server host='openfire.itvirtuoso.red' port='5222' type='tcp'/>
  </servers>
  
  <!-- register 200000 users in less than 15 minutes  -->
  <load>
    <arrivalphase phase="1" duration="15" unit="minute">
      <users maxnumber="5" interarrival="1" unit="second"></users>
    </arrivalphase>
  </load>
  
  <options>
    <option type="ts_jabber" name="global_number" value="5"></option>
    <option type="ts_jabber" name="userid_max" value="10000"></option>
    <option type="ts_jabber" name="domain" value="openfire.itvirtuoso.red"></option>
    <option type="ts_jabber" name="username" value="user"></option>
    <option type="ts_jabber" name="passwd" value="password"></option>
  </options>
  
  <sessions>
    <session probability="100" name="jabber-example" type="ts_jabber">
      <!-- connect -->
      <request>
        <jabber type="connect" ack="local"></jabber>
      </request>
      
      <!-- authenticate -->
      <transaction name="authenticate">
        <request>
          <jabber type="auth_sasl" ack="local"></jabber>
        </request>
        <request>
          <jabber type="connect" ack="local"></jabber>
        </request>
        <request>
          <jabber type="auth_sasl_bind" ack="local" ></jabber>
        </request>
        <request>
          <jabber type="auth_sasl_session" ack="local" ></jabber>
        </request>
      </transaction>

      <!-- presence online -->
      <request>
        <jabber type="presence:broadcast" show="chat" status="Available to chat" ack="no_ack"/>
      </request>

      <!-- wait 10 seconds -->
      <thinktime value="10"></thinktime>

      <!-- disconnect -->
      <request>
        <jabber type="close" ack="local"></jabber>
      </request>
    </session>
  </sessions>
</tsung>